{"class_name": "Functional", "config": {"name": "functional_59", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_features"}, "name": "input_features", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_arch"}, "name": "input_arch", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "embedding_features", "trainable": true, "dtype": "float32", "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "embedding_features", "inbound_nodes": [[["input_features", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "embedding_arch", "trainable": true, "dtype": "float32", "units": 6, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "embedding_arch", "inbound_nodes": [[["input_arch", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "combined", "trainable": true, "dtype": "float32", "axis": -1}, "name": "combined", "inbound_nodes": [[["embedding_features", 0, 0, {}], ["embedding_arch", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "embedding", "trainable": true, "dtype": "float32", "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "embedding", "inbound_nodes": [[["combined", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output", "inbound_nodes": [[["embedding", 0, 0, {}]]]}], "input_layers": [["input_features", 0, 0], ["input_arch", 0, 0]], "output_layers": [["output", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}